WebApp/document.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <env:Body>
    <Import_Currency_Conversion_Rates_Request p4:version="v39.1" xmlns:p4="urn:com.workday/bsvc" xmlns="urn:com.workday/bsvc">
      <p4:Calculate_Inverse_Rate>true</p4:Calculate_Inverse_Rate>
      <p4:Currency_Conversion_Rate_Data>
        <p4:Effective_Timestamp>2022-12-26T21:54:16</p4:Effective_Timestamp>
        <p4:From_Currency_Reference>
          <p4:ID p4:type="Currency_ID">USD</p4:ID>
        </p4:From_Currency_Reference>
        <p4:Target_Currency_Reference>
          <p4:ID p4:type="Currency_ID">INR</p4:ID>
        </p4:Target_Currency_Reference>
        <p4:Currency_Rate_Type_Reference>
          <p4:ID p4:type="Currency_Rate_Type_ID">Average</p4:ID>
        </p4:Currency_Rate_Type_Reference>
        <p4:Currency_Rate>80</p4:Currency_Rate>
      </p4:Currency_Conversion_Rate_Data>
    </Import_Currency_Conversion_Rates_Request>
  </env:Body>
</env:Envelope>